/* No comment provided by engineer. */
"%@ (Disabled: %@)" = "%1$@ (Díchumasaithe: %2$@)";

/* SettingsViewController */
"About" = "Maidir leis";

/* BookmarkViewController */
"Add Bookmark" = "Cruthaigh Leabharmharc";

/* No comment provided by engineer. */
"All rules" = "Gach riail";

/* SettingsViewController */
"Allow 3rd-Party Keyboards" = "Ceadaigh méarchláir 3ú páirtí";

/* SecurityViewController */
"Allow hosts to access WebRTC functions." = "Tabhair cead d'óstríomhairí feidhmeanna WebRTC a úsáid.";

/* SecurityViewController */
"Allow hosts to permanently store cookies and local storage databases." = "Tabhair cead d'óstaigh fianáin agus bunachair sonraí áitiúla a stóráil go buan.";

/* SecurityViewController */
"Allow HTTPS hosts to load page resources from non-HTTPS hosts. (Useful for RSS readers and other aggregators.)" = "Tabhair cead d'óstaigh HTTPS acmhainní leathanaigh a lódáil ó óstaigh nach mbaineann úsáid as HTTPS (úsáideach le haghaidh léitheoirí RSS agus comhbhailitheoirí eile)";

/* SecurityViewController */
"Allow Persistent Cookies" = "Ceadaigh fianáin sheasmhacha";

/* No comment provided by engineer. */
"Allow this page to close its tab?" = "An bhfuil cead ag an leathanach seo a chluaisín féin a dhúnadh?";

/* No comment provided by engineer. */
"An error occurred downloading image %@" = "Tharla earráid agus íomhá %@ á híoslódáil";

/* No comment provided by engineer. */
"Authentication Required" = "Fíordheimhniú de dhíth";

/* SettingsViewController */
"Auto-Complete Search Results" = "Uathlíonadh torthaí cuardaigh";

/* No comment provided by engineer. */
"Blocked 3rd-Party Hosts" = "Óstaigh 3ú Páirtí Faoi Chosc";

/* BookmarksViewController */
"Bookmarks" = "Leabharmharcanna";

/* No comment provided by engineer. */
"Bridge Configuration" = "Cumraíocht Droichead";

/* DonationViewController */
"Cancel" = "Cealaigh";

/* SettingsViewController */
"Changing this option requires restarting the app." = "Má athraíonn tú an rogha seo, caithfidh tú an aip a atosú.";

/* SettingsViewController */
"Choose, how long app remembers open tabs." = "Cé chomh fada is a mheabhraíonn an aip cluaisíní oscailte.";

/* No comment provided by engineer. */
"Close Tab" = "Dún an Cluaisín";

/* No comment provided by engineer. */
"Confirm" = "Deimhnigh";

/* SecurityViewController */
"Content Policy" = "Polasaí inneachair";

/* SettingsViewController, Storage1ViewController, Storage2ViewController */
"Cookies and Local Storage" = "Fianáin agus Stóras Áitiúil";

/* Storage1ViewController */
"Cookies and local storage data from non-whitelisted hosts will be cleared even from open tabs after not being accessed for this many minutes." = "Glanfar fianáin agus sonraí sa stóras áitiúil a bhaineann le hóstaigh nach bhfuil ar an liosta bán, fiú ó chluaisíní oscailte, mura n-úsáidtear iad go ceann an líon seo nóiméad.";

/* No comment provided by engineer. */
"Copy URL" = "Cóipeáil an URL";

/* No comment provided by engineer. */
"Create New Tab" = "Cruthaigh Cluaisín Nua";

/* No comment provided by engineer. */
"Custom settings" = "Socruithe saincheaptha";

/* SecurityViewController */
"Custom user-agent string, or blank to use the default." = "User-Agent saincheaptha, nó folamh chun an réamhshocrú a úsáid.";

/* No comment provided by engineer. */
"Default Settings" = "Réamhshocruithe";

/* No comment provided by engineer. */
"Disable" = "Díchumasaigh";

/* No comment provided by engineer. */
"Disabled: %@" = "Díchumasaithe: %@";

/* DonationViewController */
"Donate" = "Donate";

/* No comment provided by engineer. */
"Done" = "Déanta";

/* No comment provided by engineer. */
"Double-tap to dismiss pop-up window." = "Tapáil faoi dhó chun an phreabfhuinneog a dhúnadh.";

/* BookmarkViewController */
"Edit Bookmark" = "Cuir an Leabharmharc in Eagar";

/* No comment provided by engineer. */
"Enable" = "Cumasaigh";

/* No comment provided by engineer. */
"Error" = "Earráid";

/* No comment provided by engineer. */
"Fill with 1Password" = "Líon isteach le 1Password";

/* No comment provided by engineer. */
"Focus URL Field" = "Cuir an fócas sa bharra suímh";

/* No comment provided by engineer. */
"Go Back" = "Ar Ais";

/* No comment provided by engineer. */
"Go Forward" = "Ar Aghaidh";

/* SecurityViewController */
"Handle tapping on links in a non-standard way to avoid possibly opening external applications." = "Ná hoscail nascanna ar an ngnáthbhealach sa chaoi nach n-osclófar feidhmchláir sheachtracha trí thimpiste.";

/* No comment provided by engineer. */
"HTTPS Everywhere" = "HTTPS Everywhere";

/* No comment provided by engineer. */
"HTTPS Everywhere Rules" = "Rialacha HTTPS Everywhere";

/* No comment provided by engineer. */
"Ignore for this host" = "Ná déan don óstríomhaire seo";

/* SecurityViewController */
"Ignore TLS Errors" = "Déan neamhaird d'earráidí TLS";

/* DonationViewController */
"Loading in-app purchase data…" = "Loading in-app purchase data…";

/* No comment provided by engineer. */
"Log In" = "Logáil isteach";

/* No comment provided by engineer. */
"Manage Bookmarks" = "Bainistigh Leabharmharcanna";

/* SettingsViewController */
"Minimum version of TLS required for hosts to negotiate HTTPS connections." = "Leagan is ísle de TLS de dhíth chun ceangal HTTPS a shocrú.";

/* SettingsViewController */
"Miscellaneous" = "Éagsúil";

/* SettingsViewController */
"Mute Audio with Mute Switch" = "Múch an fhuaim leis an lasc balbhaithe";

/* SecurityViewController */
"No XHR/WebSocket/Video connections" = "Gan cheangal XHR/WebSocket/Físe";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Open" = "Oscail";

/* SecurityViewController */
"Open (normal browsing mode)" = "Oscail (gnáthbhrabhsáil)";

/* No comment provided by engineer. */
"Open in a New Tab" = "Oscail i gCluaisín Nua";

/* No comment provided by engineer. */
"Open in Background Tab" = "Oscail i gCluaisín Cúlra";

/* No comment provided by engineer. */
"Open in Safari" = "Oscail in Safari";

/* SecurityViewController */
"Other" = "Eile";

/* No comment provided by engineer. */
"Page bookmarked" = "Cruthaíodh leabharmharc";

/* Password */
"Password" = "Focal Faire";

/* SecurityViewController */
"Privacy" = "Príobháideachas";

/* No comment provided by engineer. */
"Pull to Refresh Page" = "Tarraing chun an leathanach a athlódáil";

/* No comment provided by engineer. */
"Quit App" = "Scoir den Aip";

/* SettingsViewController */
"Rate on App Store" = "Rátáil san App Store";

/* No comment provided by engineer. */
"Refresh" = "Athnuaigh";

/* SettingsViewController */
"Report a Bug" = "Déan tuairisc ar fhabht";

/* SecurityViewController */
"Restrictions on resources loaded from web pages." = "Srianta ar acmhainní a lódáiltear ó leathanaigh Ghréasáin.";

/* No comment provided by engineer. */
"Rules in use on current page" = "Rialacha i bhfeidhm ar an leathanach reatha";

/* No comment provided by engineer. */
"Save Image" = "Sábháil an Íomhá";

/* SettingsViewController */
"Search Engine" = "Inneall Cuardaigh";

/* SettingsViewController */
"Send Do-Not-Track Header" = "Seol ceanntásc Do-Not-Track";

/* SettingsViewController */
"Settings" = "Socruithe";

/* No comment provided by engineer. */
"Share URL" = "Comhroinn an URL";

/* No comment provided by engineer. */
"Show Bookmarks" = "Taispeáin Leabharmharcanna";

/* SettingsViewController */
"Stop Auto-Complete at First Dot" = "Stop uathlíonadh ag an chéad phonc";

/* SecurityViewController */
"Strict (no JavaScript, video, etc.)" = "Dian (gan JavaScript, físeáin, srl.)";

/* SettingsViewController */
"Support" = "Tacaíocht";

/* No comment provided by engineer. */
"Switch to Tab %d" = "Athraigh go dtí %d";

/* SettingsViewController */
"Tab Security" = "Slándáil Cluaisíní";

/* SettingsViewController */
"TLS 1.3, 1.2, 1.1 or 1.0" = "TLS 1.3, 1.2, 1.1 nó 1.0";

/* SettingsViewController */
"TLS 1.3 or 1.2" = "TLS 1.3 nó 1.2";

/* SettingsViewController */
"TLS 1.3 Only" = "TLS 1.3 Amháin";

/* No comment provided by engineer. */
"TLS certificate chain verification error (self-signed certificate?)" = "Earráid agus an slabhra teastas TLS á dheimhniú (teastas féinsínithe?)";

/* No comment provided by engineer. */
"TLS handshake failed" = "Theip ar an gcroitheadh láimhe TLS";

/* No comment provided by engineer. */
"TLS protocol error" = "Earráid leis an bprótacal TLS";

/* SettingsViewController */
"TLS Version" = "Leagan TLS";

/* No comment provided by engineer. */
"Tor connection failure" = "Theip ar cheangal le Tor";

/* SecurityViewController */
"Universal Link Protection" = "Cosaint Uilíoch Nascanna";

/* AddSiteViewController */
"URL" = "URL";

/* No comment provided by engineer. */
"URL Blocker" = "Coscaire URL";

/* SecurityViewController */
"User Agent" = "Teaghrán User-Agent";

/* No comment provided by engineer. */
"User disabled" = "Díchumasaithe ag an úsáideoir";

/* No comment provided by engineer. */
"Using defaults" = "Réamhshocruithe in úsáid";

/* SecurityViewController */
"WebRTC" = "WebRTC";

/* SettingsViewController */
"When disabled, all text entered in search bar will be sent to the search engine unless it starts with \"http\"." = "Gan an rogha seo, seolfar aon téacs a chuireann tú sa mbarra cuardaigh chuig an inneall cuardaigh, seachas aon téacs a thosaíonn le \"http\".";

/* No comment provided by engineer. */
"__CONNECTION_FAILURE_DESCRIPTION__" = "Chaill Brabhsálaí Onion an ceangal le líonra Tor agus ní féidir leis an ceangal a athbhunú. Tarlaíonn sé seo má théann Brabhsálaí Onion sa chúlra, nó má théann an gléas ina chodladh agus an brabhsálaí oscailte.\n\nScoir den aip agus bain triail eile as. Más gá duit leabharmharc a chruthú, nó sonraí ón leathanach reatha a shábháil, tapáil 'OK' le fanacht anseo gan cheangal líonra.";

/* DonationViewController */
"__DONATE_EXPLANATION_PARAGRAPH1__" = "Onion Browser is a free app, but it takes time and resources to develop and maintain.";

/* DonationViewController */
"__DONATE_EXPLANATION_PARAGRAPH2__" = "You can support the app by sending a small tip through an in-app purchase, below. This is a one-time, non-recurring transaction, but you can come back any time to send another. No information about your in-app purchase is collected or stored by the Onion Browser developers.";

/* DonationViewController */
"__DONATE_EXPLANATION_PARAGRAPH3__" = "You can learn about other ways to help (including Patreon, PayPal, Bitcoin, or Zcash) in the 'About' section of the 'Settings' page.";

/* DonationViewController */
"__DONATE_THANKS__" = "Thank you! Every little bit helps! Your payment of %@ helps ensure continuing development on Onion Browser and tools that make Tor easier to integrate into other iOS apps.";
